In [3]:
import pandas as pd
import numpy as np

In [5]:
#khởi tạo series có giá trị khuyết thiếu
s = pd.Series([1, 2, np.nan, 4], dtype=pd.Int64Dtype())

In [6]:
# kiểm tra phần tử nào bị khuyết
s.isna()

0    False
1    False
2     True
3    False
dtype: bool

In [7]:
# kiểm tra phần tử nào không bị khuyết
s.notna()

0     True
1     True
2    False
3     True
dtype: bool

In [8]:
# xóa dữ liệu khuyết thiếu
s.dropna()

0    1
1    2
3    4
dtype: Int64

In [24]:
#khởi tạo một DF có giá trị NA
df = pd.DataFrame({"name": ['Alfred', 'Batman', 'Catwoman'], "toy": [np.nan, 'Batmobile', 'Bullwhip'], "born": [pd.NaT, pd.Timestamp("1940-04-25"), pd.NaT]})
df1 = df
df2 = df
df3 = df
df4 = df
df5 = df
df6 = df
df

       name        toy       born
0    Alfred        NaN        NaT
1    Batman  Batmobile 1940-04-25
2  Catwoman   Bullwhip        NaT

In [19]:
# xóa dòng mà có ít nhất 1 phần tử bị khuyết.
"""failed"""
df.dropna()
df

       name        toy       born
0    Alfred        NaN        NaT
1    Batman  Batmobile 1940-04-25
2  Catwoman   Bullwhip        NaT

In [20]:
#xóa cột mà có ít nhất 1 phần tử bị khuyết
df1.dropna(axis='columns')

       name
0    Alfred
1    Batman
2  Catwoman

In [21]:
#bỏ các hàng mà thiếu tất cả các phần tử
"""failed"""
df2.dropna(how='all')

       name        toy       born
0    Alfred        NaN        NaT
1    Batman  Batmobile 1940-04-25
2  Catwoman   Bullwhip        NaT

In [23]:
#giữ lại những hàng có ít nhất 2 giá trị không bị khuyết:
df3.dropna(thresh=2)

       name        toy       born
1    Batman  Batmobile 1940-04-25
2  Catwoman   Bullwhip        NaT

In [25]:
#xóa những hàng mà giá trị khuyết phải nằm trên các cột xác định trước
df4.dropna(subset=['name','toy'])

       name        toy       born
1    Batman  Batmobile 1940-04-25
2  Catwoman   Bullwhip        NaT